igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/rp2350_eval_zend.c
ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_epd_set_pixel, 0, 3, _IS_BOOL, 0)
	ZEND_ARG_TYPE_INFO(0, x, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, y, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, black, _IS_BOOL, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_epd_update, 0, 0, _IS_BOOL, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_epd_render, 0, 3, _IS_BOOL, 0)
	ZEND_ARG_TYPE_INFO(0, bytes, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, width, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, height, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, x, IS_LONG, 1)
	ZEND_ARG_TYPE_INFO(0, y, IS_LONG, 1)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_battery_voltage, 0, 0, IS_DOUBLE, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_usb_connected, 0, 0, _IS_BOOL, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_battery_mv, 0, 0, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_battery_raw_vbat, 0, 0, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_battery_raw_vref, 0, 0, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_wifi_init, 0, 0, _IS_BOOL, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_wifi_connect, 0, 1, _IS_BOOL, 0)
	ZEND_ARG_TYPE_INFO(0, ssid, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, password, IS_STRING, 1)
	ZEND_ARG_TYPE_INFO(0, timeout_ms, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_wifi_disconnect, 0, 0, _IS_BOOL, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_wifi_status, 0, 0, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_MASK_EX(arginfo_mcu_wifi_ip, 0, 0, MAY_BE_STRING | MAY_BE_FALSE)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_MASK_EX(arginfo_mcu_tcp_request, 0, 3, MAY_BE_STRING | MAY_BE_FALSE)
	ZEND_ARG_TYPE_INFO(0, host, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, port, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, payload, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, timeout_ms, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, max_read, IS_LONG, 0)
ZEND_END_ARG_INFO()

ZEND_BEGIN_ARG_WITH_RETURN_TYPE_INFO_EX(arginfo_mcu_udp_sendto, 0, 3, _IS_BOOL, 0)
	ZEND_ARG_TYPE_INFO(0, host, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, port, IS_LONG, 0)
	ZEND_ARG_TYPE_INFO(0, payload, IS_STRING, 0)
	ZEND_ARG_TYPE_INFO(0, timeout_ms, IS_LONG, 0)
ZEND_END_ARG_INFO()

static const zend_function_entry rp2350_mcu_functions[] = {
	ZEND_FE(mcu_button_pressed, arginfo_mcu_button_pressed)
	ZEND_FE(mcu_button_state_mask, arginfo_mcu_button_state_mask)
	ZEND_FE(mcu_button_wait, arginfo_mcu_button_wait)
	ZEND_FE(mcu_led_set, arginfo_mcu_led_set)
	ZEND_FE(mcu_led_level, arginfo_mcu_led_level)
	ZEND_FE(mcu_epd_fill, arginfo_mcu_epd_fill)
	ZEND_FE(mcu_epd_clear, arginfo_mcu_epd_clear)
	ZEND_FE(mcu_epd_set_pixel, arginfo_mcu_epd_set_pixel)
	ZEND_FE(mcu_epd_update, arginfo_mcu_epd_update)
	ZEND_FE(mcu_epd_render, arginfo_mcu_epd_render)
	ZEND_FE(mcu_battery_voltage, arginfo_mcu_battery_voltage)
	ZEND_FE(mcu_battery_mv, arginfo_mcu_battery_mv)
	ZEND_FE(mcu_usb_connected, arginfo_mcu_usb_connected)
	ZEND_FE(mcu_battery_raw_vbat, arginfo_mcu_battery_raw_vbat)
	ZEND_FE(mcu_battery_raw_vref, arginfo_mcu_battery_raw_vref)
	ZEND_FE(mcu_wifi_init, arginfo_mcu_wifi_init)
	ZEND_FE(mcu_wifi_connect, arginfo_mcu_wifi_connect)
	ZEND_FE(mcu_wifi_disconnect, arginfo_mcu_wifi_disconnect)
	ZEND_FE(mcu_wifi_status, arginfo_mcu_wifi_status)
	ZEND_FE(mcu_wifi_ip, arginfo_mcu_wifi_ip)
	ZEND_FE(mcu_tcp_request, arginfo_mcu_tcp_request)
	ZEND_FE(mcu_udp_sendto, arginfo_mcu_udp_sendto)
	ZEND_FE_END
};

static zend_module_entry rp2350_mcu_module_entry = {
	STANDARD_MODULE_HEADER,
	"rp2350_mcu",
	rp2350_mcu_functions,
	PHP_MINIT(rp2350_mcu),
	NULL,
	NULL,
	NULL,
	NULL,
	NO_VERSION_YET,
	STANDARD_MODULE_PROPERTIES
};

static bool rp2350_button_gpio_is_pressed(uint32_t gpio)
{
	return gpio_get(gpio) == 0;
}

static uint32_t rp2350_led_gpio_for_index(zend_long index)
{
	switch (index) {
		case 0: return BW_LED_0;
		case 1: return BW_LED_1;
		case 2: return BW_LED_2;
		case 3: return BW_LED_3;
		default: return UINT32_MAX;
	}
}

static uint32_t rp2350_button_gpio_for_id(zend_long button)
{
	switch (button) {
		case 0: return BW_SWITCH_A;
		case 1: return BW_SWITCH_B;
		case 2: return BW_SWITCH_C;
		case 3: return BW_SWITCH_UP;
		case 4: return BW_SWITCH_DOWN;
		case 5: return BW_SWITCH_HOME;
		case 6: return BW_RESET_SW;
		default: return UINT32_MAX;
	}
}

static void rp2350_leds_init(void)
{
	const uint32_t gpios[] = { BW_LED_0, BW_LED_1, BW_LED_2, BW_LED_3 };
	size_t i;

	if (s_leds_init) {
		return;
	}
	for (i = 0; i < sizeof(gpios) / sizeof(gpios[0]); i++) {
		uint slice;
		uint chan;
		gpio_set_function(gpios[i], GPIO_FUNC_PWM);
		slice = pwm_gpio_to_slice_num(gpios[i]);
		chan = pwm_gpio_to_channel(gpios[i]);
		pwm_set_wrap(slice, 65535);
		pwm_set_chan_level(slice, chan, 0);
		pwm_set_enabled(slice, true);
	}
	s_leds_init = true;
}

static void rp2350_power_sense_init(void)
{
	if (s_power_sense_init) {
		return;
	}

	/* Match board bring-up expectations: keep switched power rail enabled. */
	gpio_init(BW_SW_POWER_EN);
	gpio_set_dir(BW_SW_POWER_EN, GPIO_OUT);
	gpio_put(BW_SW_POWER_EN, 1);

	/* VBAT_SENSE and SENSE_1V1 are from Badger 2350 reference firmware. */
	adc_init();
	adc_gpio_init(26); /* VBAT_SENSE */
	adc_gpio_init(28); /* SENSE_1V1 */

	gpio_init(BW_VBUS_DETECT);
	gpio_set_dir(BW_VBUS_DETECT, GPIO_IN);
	gpio_disable_pulls(BW_VBUS_DETECT);

	s_power_sense_init = true;
}

static bool rp2350_wifi_init_once(void)
{
	if (s_wifi_init) {
		return true;
	}
	if (cyw43_arch_init() != 0) {
		return false;
	}
	cyw43_arch_enable_sta_mode();
	s_wifi_init = true;
	return true;
}

static uint16_t rp2350_adc_read_avg(uint input, uint samples)
{
	uint32_t sum = 0;
	uint i;

	for (i = 0; i < samples; i++) {
		adc_select_input(input);
		sleep_us(5);
		(void)adc_read(); /* throw-away after mux switch */
		sleep_us(5);
		sum += adc_read();
		sleep_us(20);
	}

	return (uint16_t)(sum / samples);
}

