igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/rp2350_eval_zend.c
static bool rp2350_http_get_body(const char *url, uint32_t timeout_ms, size_t max_read, char **body_out, size_t *body_len_out)
{
	char host[96];
	u16_t port;
	const char *path;
	char *request = NULL;
	size_t request_cap;
	size_t request_len;
	char *response = NULL;
	size_t response_len = 0;
	size_t i;
	size_t body_off = 0;
	size_t body_len;
	char *body = NULL;

	*body_out = NULL;
	*body_len_out = 0;

	if (!rp2350_parse_http_url(url, host, sizeof(host), &port, &path)) {
		return false;
	}

	request_cap = strlen(path) + strlen(host) + 96;
	request = (char *)malloc(request_cap);
	if (!request) {
		return false;
	}
	request_len = (size_t)snprintf(
		request,
		request_cap,
		"GET %s HTTP/1.0\r\nHost: %s\r\nConnection: close\r\n\r\n",
		path,
		host
	);

	if (!rp2350_net_tcp_request(host, port, request, request_len, timeout_ms, max_read, &response, &response_len)) {
		free(request);
		return false;
	}
	free(request);

	for (i = 0; i + 3 < response_len; i++) {
		if (response[i] == '\r' && response[i + 1] == '\n' && response[i + 2] == '\r' && response[i + 3] == '\n') {
			body_off = i + 4;
			break;
		}
	}
	if (body_off == 0) {
		for (i = 0; i + 1 < response_len; i++) {
			if (response[i] == '\n' && response[i + 1] == '\n') {
				body_off = i + 2;
				break;
			}
		}
	}

	body_len = (body_off < response_len) ? (response_len - body_off) : response_len;
	body = (char *)malloc(body_len + 1);
	if (!body) {
		free(response);
		return false;
	}
	memcpy(body, response + body_off, body_len);
	body[body_len] = '\0';
	free(response);

	*body_out = body;
	*body_len_out = body_len;
	return true;
}

static void rp2350_zend_interrupt_handler(zend_execute_data *execute_data)
{
	uint32_t pending;
	uint32_t irq_state;

	(void)execute_data;

	irq_state = save_and_disable_interrupts();
	pending = s_button_irq_pending_mask;
	s_button_irq_pending_mask = 0;
	restore_interrupts(irq_state);
	(void)pending;

	if (s_prev_zend_interrupt_function) {
		s_prev_zend_interrupt_function(execute_data);
	}
}

static void rp2350_button_gpio_irq(uint gpio, uint32_t events)
{
	int id = -1;
	bool pressed;

	(void)events;
	switch (gpio) {
		case BW_SWITCH_A: id = 0; break;
		case BW_SWITCH_B: id = 1; break;
		case BW_SWITCH_C: id = 2; break;
		case BW_SWITCH_UP: id = 3; break;
		case BW_SWITCH_DOWN: id = 4; break;
		case BW_SWITCH_HOME: id = 5; break;
		case BW_RESET_SW: id = 6; break;
		default: return;
	}

	pressed = rp2350_button_gpio_is_pressed(gpio);
	if (pressed) {
		s_button_state_mask |= (1u << id);
	} else {
		s_button_state_mask &= ~(1u << id);
	}
	s_button_irq_pending_mask |= (1u << id);
	s_button_irq_generation++;
	sem_release(&s_button_sem);

	if (rp2350_zend_started) {
		zend_atomic_bool_store_ex(&EG(vm_interrupt), true);
	}
}

static void rp2350_buttons_init(void)
{
	const uint32_t gpios[] = {
		BW_SWITCH_A, BW_SWITCH_B, BW_SWITCH_C, BW_SWITCH_UP, BW_SWITCH_DOWN,
		BW_SWITCH_HOME, BW_RESET_SW
	};
	size_t i;
	bool callback_set = false;

	if (s_buttons_init) {
		return;
	}

	/* Start from a deterministic state; first IRQ updates the live mask. */
	s_button_state_mask = 0;
	s_button_irq_pending_mask = 0;
	s_button_irq_generation = 0;
	sem_init(&s_button_sem, 0, 255);

	for (i = 0; i < sizeof(gpios) / sizeof(gpios[0]); i++) {
		uint32_t gpio = gpios[i];
		gpio_init(gpio);
		gpio_set_dir(gpio, GPIO_IN);
		gpio_pull_up(gpio);
		if (!callback_set) {
			gpio_set_irq_enabled_with_callback(
				gpio,
				GPIO_IRQ_EDGE_FALL | GPIO_IRQ_EDGE_RISE,
				true,
				&rp2350_button_gpio_irq
			);
			callback_set = true;
		} else {
			gpio_set_irq_enabled(gpio, GPIO_IRQ_EDGE_FALL | GPIO_IRQ_EDGE_RISE, true);
		}
	}

	s_buttons_init = true;
}

ZEND_FUNCTION(mcu_button_pressed)
{
	zend_long button = -1;
	bool button_is_null = true;

	ZEND_PARSE_PARAMETERS_START(0, 1)
		Z_PARAM_OPTIONAL
		Z_PARAM_LONG_OR_NULL(button, button_is_null)
	ZEND_PARSE_PARAMETERS_END();

	rp2350_buttons_init();

	if (button_is_null || button < 0) {
		RETURN_BOOL(
			rp2350_button_gpio_is_pressed(BW_SWITCH_A) ||
			rp2350_button_gpio_is_pressed(BW_SWITCH_B) ||
			rp2350_button_gpio_is_pressed(BW_SWITCH_C) ||
			rp2350_button_gpio_is_pressed(BW_SWITCH_UP) ||
			rp2350_button_gpio_is_pressed(BW_SWITCH_DOWN));
	}

	{
		uint32_t gpio = rp2350_button_gpio_for_id(button);
		if (gpio == UINT32_MAX) {
			zend_argument_value_error(1, "must be one of MCU_BTN_A..MCU_BTN_RESET");
			RETURN_THROWS();
		}
		RETURN_BOOL(rp2350_button_gpio_is_pressed(gpio));
	}
}

ZEND_FUNCTION(mcu_button_state_mask)
{
	uint32_t irq_state;
	uint32_t mask;

	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_buttons_init();

	irq_state = save_and_disable_interrupts();
	mask = s_button_state_mask;
	restore_interrupts(irq_state);

	RETURN_LONG((zend_long)mask);
}

ZEND_FUNCTION(mcu_button_wait)
{
	zend_long timeout_ms = 0;
	bool ok;

	ZEND_PARSE_PARAMETERS_START(1, 1)
		Z_PARAM_LONG(timeout_ms)
	ZEND_PARSE_PARAMETERS_END();

	if (timeout_ms < 0) {
		timeout_ms = 0;
	}

	rp2350_buttons_init();

	if (timeout_ms == 0) {
		RETURN_FALSE;
	}

	ok = sem_acquire_timeout_ms(&s_button_sem, (uint32_t)timeout_ms);
	if (!ok) {
		RETURN_FALSE;
	}

	{
		uint32_t irq_state = save_and_disable_interrupts();
		uint32_t mask = s_button_state_mask;
		restore_interrupts(irq_state);
		RETURN_LONG((zend_long)mask);
	}
}

PHP_MINIT_FUNCTION(rp2350_mcu)
{
	REGISTER_LONG_CONSTANT("MCU_BTN_A", 0, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_B", 1, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_C", 2, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_UP", 3, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_DOWN", 4, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_HOME", 5, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_BTN_RESET", 6, CONST_CS | CONST_PERSISTENT);

	REGISTER_LONG_CONSTANT("MCU_LED_0", 0, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_LED_1", 1, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_LED_2", 2, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_LED_3", 3, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_DOWN", CYW43_LINK_DOWN, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_JOIN", CYW43_LINK_JOIN, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_NOIP", CYW43_LINK_NOIP, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_UP", CYW43_LINK_UP, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_FAIL", CYW43_LINK_FAIL, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_NONET", CYW43_LINK_NONET, CONST_CS | CONST_PERSISTENT);
	REGISTER_LONG_CONSTANT("MCU_WIFI_LINK_BADAUTH", CYW43_LINK_BADAUTH, CONST_CS | CONST_PERSISTENT);

