igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/rp2350_eval_zend.c
	rp2350_leds_init();
	rp2350_buttons_init();

	return SUCCESS;
}

ZEND_FUNCTION(mcu_led_set)
{
	zend_long index = 0;
	bool on = false;
	uint32_t gpio;

	ZEND_PARSE_PARAMETERS_START(2, 2)
		Z_PARAM_LONG(index)
		Z_PARAM_BOOL(on)
	ZEND_PARSE_PARAMETERS_END();

	gpio = rp2350_led_gpio_for_index(index);
	if (gpio == UINT32_MAX) {
		zend_argument_value_error(1, "must be between 0 and 3");
		RETURN_THROWS();
	}

	rp2350_leds_init();

	{
		uint slice = pwm_gpio_to_slice_num(gpio);
		uint chan = pwm_gpio_to_channel(gpio);
		pwm_set_chan_level(slice, chan, on ? 65535u : 0u);
	}
	RETURN_TRUE;
}

ZEND_FUNCTION(mcu_led_level)
{
	zend_long index = 0;
	zend_long level = 0;
	uint32_t gpio;

	ZEND_PARSE_PARAMETERS_START(2, 2)
		Z_PARAM_LONG(index)
		Z_PARAM_LONG(level)
	ZEND_PARSE_PARAMETERS_END();

	if (level < 0) {
		level = 0;
	} else if (level > 65535) {
		level = 65535;
	}

	gpio = rp2350_led_gpio_for_index(index);
	if (gpio == UINT32_MAX) {
		zend_argument_value_error(1, "must be between 0 and 3");
		RETURN_THROWS();
	}

	rp2350_leds_init();

	{
		uint slice = pwm_gpio_to_slice_num(gpio);
		uint chan = pwm_gpio_to_channel(gpio);
		pwm_set_chan_level(slice, chan, (uint16_t)level);
	}
	RETURN_TRUE;
}

ZEND_FUNCTION(mcu_epd_fill)
{
	bool black = false;

	ZEND_PARSE_PARAMETERS_START(1, 1)
		Z_PARAM_BOOL(black)
	ZEND_PARSE_PARAMETERS_END();

	RETURN_BOOL(rp2350_epd_fill(black));
}

ZEND_FUNCTION(mcu_epd_clear)
{
	bool black = false;

	ZEND_PARSE_PARAMETERS_START(1, 1)
		Z_PARAM_BOOL(black)
	ZEND_PARSE_PARAMETERS_END();

	RETURN_BOOL(rp2350_epd_clear(black));
}

ZEND_FUNCTION(mcu_epd_set_pixel)
{
	zend_long x = 0;
	zend_long y = 0;
	bool black = false;

	ZEND_PARSE_PARAMETERS_START(3, 3)
		Z_PARAM_LONG(x)
		Z_PARAM_LONG(y)
		Z_PARAM_BOOL(black)
	ZEND_PARSE_PARAMETERS_END();

	RETURN_BOOL(rp2350_epd_set_pixel((int)x, (int)y, black));
}

ZEND_FUNCTION(mcu_epd_update)
{
	ZEND_PARSE_PARAMETERS_NONE();
	RETURN_BOOL(rp2350_epd_update());
}

ZEND_FUNCTION(mcu_epd_render)
{
	char *bytes = NULL;
	size_t bytes_len = 0;
	zend_long width = 0;
	zend_long height = 0;
	zend_long x = -1;
	zend_long y = -1;
	int draw_x;
	int draw_y;

	ZEND_PARSE_PARAMETERS_START(3, 5)
		Z_PARAM_STRING(bytes, bytes_len)
		Z_PARAM_LONG(width)
		Z_PARAM_LONG(height)
		Z_PARAM_OPTIONAL
		Z_PARAM_LONG(x)
		Z_PARAM_LONG(y)
	ZEND_PARSE_PARAMETERS_END();

	if (width <= 0 || height <= 0) {
		RETURN_FALSE;
	}

	draw_x = (x >= 0) ? (int)x : (264 - (int)width) / 2;
	draw_y = (y >= 0) ? (int)y : (176 - (int)height) / 2;

	if (!rp2350_epd_clear(false)) {
		RETURN_FALSE;
	}
	if (!rp2350_epd_render_1bpp((const uint8_t *)bytes, bytes_len, (int)width, (int)height, draw_x, draw_y)) {
		RETURN_FALSE;
	}
	RETURN_BOOL(rp2350_epd_update());
}

ZEND_FUNCTION(mcu_usb_connected)
{
	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_power_sense_init();
	RETURN_BOOL(gpio_get(BW_VBUS_DETECT) != 0);
}

ZEND_FUNCTION(mcu_battery_voltage)
{
	uint16_t vbat_raw;
	uint16_t vref_raw;
	double voltage;

	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_power_sense_init();

	/* ADC input 0 = GPIO26 (VBAT_SENSE), input 2 = GPIO28 (SENSE_1V1). */
	vbat_raw = rp2350_adc_read_avg(0u, 10u);
	vref_raw = rp2350_adc_read_avg(2u, 10u);

	/* Prefer calibrated path (matches stock), fallback to 3.3V ADC scale if VREF sense is invalid. */
	if (vref_raw >= 16u) {
		voltage = ((double)vbat_raw / (double)vref_raw) * 2.0 * 1.1;
	} else {
		voltage = ((double)vbat_raw / 4095.0) * 3.3 * 2.0;
	}

	if (voltage < 0.0) {
		voltage = 0.0;
	} else if (voltage > 6.0) {
		voltage = 6.0;
	}
	RETURN_DOUBLE(voltage);
}

ZEND_FUNCTION(mcu_battery_mv)
{
	uint16_t vbat_raw;
	uint16_t vref_raw;
	uint32_t mv;

	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_power_sense_init();

	vbat_raw = rp2350_adc_read_avg(0u, 10u);
	vref_raw = rp2350_adc_read_avg(2u, 10u);
	if (vref_raw == 0u) {
		RETURN_LONG(0);
	}

	mv = ((uint32_t)vbat_raw * 2200u + ((uint32_t)vref_raw / 2u)) / (uint32_t)vref_raw;
	if (mv > 6000u) {
		mv = 6000u;
	}
	RETURN_LONG((zend_long)mv);
}

ZEND_FUNCTION(mcu_battery_raw_vbat)
{
	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_power_sense_init();
	RETURN_LONG((zend_long)rp2350_adc_read_avg(0u, 10u));
}

ZEND_FUNCTION(mcu_battery_raw_vref)
{
	ZEND_PARSE_PARAMETERS_NONE();
	rp2350_power_sense_init();
	RETURN_LONG((zend_long)rp2350_adc_read_avg(2u, 10u));
}

ZEND_FUNCTION(mcu_wifi_init)
{
	ZEND_PARSE_PARAMETERS_NONE();
	RETURN_BOOL(rp2350_wifi_init_once());
}

ZEND_FUNCTION(mcu_wifi_connect)
{
	char *ssid = NULL;
	size_t ssid_len = 0;
	char *password = NULL;
	size_t password_len = 0;
	zend_long timeout_ms = 15000;
	uint32_t auth = CYW43_AUTH_OPEN;
	int rc;

	ZEND_PARSE_PARAMETERS_START(1, 3)
		Z_PARAM_STRING(ssid, ssid_len)
		Z_PARAM_OPTIONAL
		Z_PARAM_STRING_OR_NULL(password, password_len)
		Z_PARAM_LONG(timeout_ms)
	ZEND_PARSE_PARAMETERS_END();

	if (ssid_len == 0) {
		zend_argument_value_error(1, "must not be empty");
		RETURN_THROWS();
	}
	if (timeout_ms < 0) {
		timeout_ms = 0;
	}
	if (!rp2350_wifi_init_once()) {
		RETURN_FALSE;
	}

	if (password != NULL && password_len > 0) {
		auth = CYW43_AUTH_WPA2_AES_PSK;
	}

	rc = cyw43_arch_wifi_connect_timeout_ms(
		ssid,
		password,
		auth,
		(uint32_t)timeout_ms
	);
	RETURN_BOOL(rc == 0);
}

ZEND_FUNCTION(mcu_wifi_disconnect)
{
	int rc;

	ZEND_PARSE_PARAMETERS_NONE();
	if (!s_wifi_init) {
		RETURN_TRUE;
	}
	rc = cyw43_wifi_leave(&cyw43_state, CYW43_ITF_STA);
	RETURN_BOOL(rc == 0);
}

ZEND_FUNCTION(mcu_wifi_status)
{
	int status;

	ZEND_PARSE_PARAMETERS_NONE();
	if (!s_wifi_init) {
		RETURN_LONG(CYW43_LINK_DOWN);
	}
	status = cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA);
	RETURN_LONG(status);
}

ZEND_FUNCTION(mcu_wifi_ip)
{
	const ip4_addr_t *addr;
	char text[IP4ADDR_STRLEN_MAX];

	ZEND_PARSE_PARAMETERS_NONE();
	if (!s_wifi_init || netif_default == NULL) {
		RETURN_FALSE;
	}
	addr = netif_ip4_addr(netif_default);
	if (addr == NULL || ip4_addr_isany_val(*addr)) {
		RETURN_FALSE;
	}
	if (ip4addr_ntoa_r(addr, text, sizeof(text)) == NULL) {
		RETURN_FALSE;
	}
	RETURN_STRING(text);
}

ZEND_FUNCTION(mcu_tcp_request)
{
	char *host = NULL;
	size_t host_len = 0;
	zend_long port = 0;
	char *payload = NULL;
	size_t payload_len = 0;
	zend_long timeout_ms = 5000;
	zend_long max_read = 4096;
	char *resp = NULL;
	size_t resp_len = 0;

