igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/rp2350_eval_zend.c
	ZEND_PARSE_PARAMETERS_START(3, 5)
		Z_PARAM_STRING(host, host_len)
		Z_PARAM_LONG(port)
		Z_PARAM_STRING(payload, payload_len)
		Z_PARAM_OPTIONAL
		Z_PARAM_LONG(timeout_ms)
		Z_PARAM_LONG(max_read)
	ZEND_PARSE_PARAMETERS_END();

	if (host_len == 0) {
		zend_argument_value_error(1, "must not be empty");
		RETURN_THROWS();
	}
	if (port <= 0 || port > 65535) {
		zend_argument_value_error(2, "must be between 1 and 65535");
		RETURN_THROWS();
	}
	if (timeout_ms < 100) {
		timeout_ms = 100;
	}
	if (max_read < 1) {
		max_read = 1;
	} else if (max_read > 262144) {
		max_read = 262144;
	}

	if (!rp2350_net_tcp_request(
		host,
		(u16_t)port,
		payload,
		payload_len,
		(uint32_t)timeout_ms,
		(size_t)max_read,
		&resp,
		&resp_len
	)) {
		RETURN_FALSE;
	}
	RETVAL_STRINGL(resp, resp_len);
	free(resp);
}

ZEND_FUNCTION(mcu_udp_sendto)
{
	char *host = NULL;
	size_t host_len = 0;
	zend_long port = 0;
	char *payload = NULL;
	size_t payload_len = 0;
	zend_long timeout_ms = 2000;
	ip_addr_t remote;
	struct udp_pcb *pcb = NULL;
	struct pbuf *pb = NULL;
	bool ok = false;

	ZEND_PARSE_PARAMETERS_START(3, 4)
		Z_PARAM_STRING(host, host_len)
		Z_PARAM_LONG(port)
		Z_PARAM_STRING(payload, payload_len)
		Z_PARAM_OPTIONAL
		Z_PARAM_LONG(timeout_ms)
	ZEND_PARSE_PARAMETERS_END();

	if (host_len == 0) {
		zend_argument_value_error(1, "must not be empty");
		RETURN_THROWS();
	}
	if (port <= 0 || port > 65535) {
		zend_argument_value_error(2, "must be between 1 and 65535");
		RETURN_THROWS();
	}
	if (timeout_ms < 100) {
		timeout_ms = 100;
	}
	if (payload_len > 1472) {
		zend_argument_value_error(3, "must be 1472 bytes or less");
		RETURN_THROWS();
	}

	if (!rp2350_wifi_init_once()) {
		RETURN_FALSE;
	}
	if (cyw43_tcpip_link_status(&cyw43_state, CYW43_ITF_STA) != CYW43_LINK_UP) {
		RETURN_FALSE;
	}
	if (!rp2350_dns_resolve(host, (uint32_t)timeout_ms, &remote)) {
		RETURN_FALSE;
	}

	cyw43_arch_lwip_begin();
	pcb = udp_new_ip_type(IP_GET_TYPE(&remote));
	if (pcb != NULL) {
		pb = pbuf_alloc(PBUF_TRANSPORT, (u16_t)payload_len, PBUF_RAM);
		if (pb != NULL) {
			memcpy(pb->payload, payload, payload_len);
			ok = (udp_sendto(pcb, pb, &remote, (u16_t)port) == ERR_OK);
		}
	}
	if (pb != NULL) {
		pbuf_free(pb);
	}
	if (pcb != NULL) {
		udp_remove(pcb);
	}
	cyw43_arch_lwip_end();

	RETURN_BOOL(ok);
}

static void rp2350_zend_error_cb(int type, zend_string *error_filename, const uint32_t error_lineno, zend_string *message)
{
	char line[384];
	const char *file = error_filename ? ZSTR_VAL(error_filename) : "<eval>";
	const char *msg = message ? ZSTR_VAL(message) : "<null>";
	size_t msg_len = message ? ZSTR_LEN(message) : strlen(msg);
	if (msg_len > 140) {
		msg_len = 140;
	}
	int n = snprintf(
		line,
		sizeof(line),
		"[zend:%d] %s:%" PRIu32 " %.*s\r\n",
		type,
		file,
		error_lineno,
		(int)msg_len,
		msg
	);
	if (n > 0) {
		rp2350_platform_write(line, (size_t) n);
	}
	snprintf(
		rp2350_last_zend_error,
		sizeof(rp2350_last_zend_error),
		"type=%d file=%s:%" PRIu32 " msg=%.*s",
		type,
		file,
		error_lineno,
		(int)msg_len,
		msg
	);
}

static size_t rp2350_zend_printf(const char *format, ...)
{
	char line[384];
	va_list ap;
	int n;

	va_start(ap, format);
	n = vsnprintf(line, sizeof(line), format, ap);
	va_end(ap);

	if (n <= 0) {
		return 0;
	}
	if ((size_t) n > sizeof(line)) {
		n = (int) sizeof(line);
	}
	return rp2350_platform_write(line, (size_t) n);
}

static size_t rp2350_zend_write(const char *str, size_t str_length)
{
	return rp2350_platform_write(str, str_length);
}

static FILE *rp2350_zend_fopen(zend_string *filename, zend_string **opened_path)
{
	(void) filename;
	(void) opened_path;
	return NULL;
}

static void rp2350_zend_message_handler(zend_long message, const void *data)
{
	(void) message;
	(void) data;
}

static zval *rp2350_zend_get_configuration_directive(zend_string *name)
{
	(void) name;
	return NULL;
}

static void rp2350_zend_ticks(int ticks)
{
	(void) ticks;
}

static void rp2350_zend_timeout(int seconds)
{
	(void) seconds;
}

static int rp2350_sapi_startup(sapi_module_struct *sapi_module)
{
	return php_module_startup(sapi_module, NULL);
}

static size_t rp2350_sapi_ub_write(const char *str, size_t str_length)
{
	return rp2350_platform_write(str, str_length);
}

static void rp2350_sapi_flush(void *server_context)
{
	(void) server_context;
	rp2350_platform_flush();
}

static size_t rp2350_sapi_read_post(char *buffer, size_t count_bytes)
{
	(void)buffer;
	(void)count_bytes;
	return 0;
}

static void rp2350_sapi_treat_data(int arg, char *str, zval *destArray)
{
	(void)str;
	if (destArray) {
		array_init(destArray);
		return;
	}

	switch (arg) {
		case PARSE_GET:
			zval_ptr_dtor_nogc(&PG(http_globals)[TRACK_VARS_GET]);
			array_init(&PG(http_globals)[TRACK_VARS_GET]);
			break;
		case PARSE_POST:
			zval_ptr_dtor_nogc(&PG(http_globals)[TRACK_VARS_POST]);
			array_init(&PG(http_globals)[TRACK_VARS_POST]);
			break;
		case PARSE_COOKIE:
			zval_ptr_dtor_nogc(&PG(http_globals)[TRACK_VARS_COOKIE]);
			array_init(&PG(http_globals)[TRACK_VARS_COOKIE]);
			break;
		default:
			break;
	}
}

static char *rp2350_sapi_read_cookies(void)
{
	return NULL;
}

static char *rp2350_sapi_getenv(const char *name, size_t name_len)
{
	if (!name) {
		return NULL;
	}
	if (name_len == (sizeof("WIFI_SSID") - 1) && memcmp(name, "WIFI_SSID", sizeof("WIFI_SSID") - 1) == 0) {
		if (s_env_wifi_ssid[0] == '\0') {
			return NULL;
		}
		return strdup(s_env_wifi_ssid);
	}
	if (name_len == (sizeof("WIFI_PASS") - 1) && memcmp(name, "WIFI_PASS", sizeof("WIFI_PASS") - 1) == 0) {
		if (s_env_wifi_pass[0] == '\0') {
			return NULL;
		}
		return strdup(s_env_wifi_pass);
	}
	return NULL;
}

static void rp2350_sapi_log_message(const char *message, int syslog_type_int)
{
	(void) syslog_type_int;
	if (message) {
		rp2350_platform_write("[php] ", sizeof("[php] ") - 1);
		rp2350_platform_write(message, strlen(message));
		rp2350_platform_write("\r\n", 2);
	}
}

static void rp2350_sapi_register_variables(zval *track_vars_array)
{
	php_import_environment_variables(track_vars_array);
}

#define RP2350_INI_DEFAULT(name, value) \
	ZVAL_NEW_STR(&tmp, zend_string_init(value, sizeof(value) - 1, 1)); \
	zend_hash_str_update(configuration_hash, name, sizeof(name) - 1, &tmp)

static void rp2350_sapi_ini_defaults(HashTable *configuration_hash)
{
	zval tmp;

	RP2350_INI_DEFAULT("html_errors", "0");
	RP2350_INI_DEFAULT("display_errors", "1");
	RP2350_INI_DEFAULT("display_startup_errors", "1");
	RP2350_INI_DEFAULT("log_errors", "0");
}

