igorwwwwwwwwwwwwwwwwwwww/php-src/sapi/rp2350/rp2350_eval_zend.c
static void rp2350_force_plain_errors_runtime(void)
{
	zend_string *name;

	name = zend_string_init("html_errors", sizeof("html_errors") - 1, 0);
	(void)zend_alter_ini_entry_chars(name, "0", 1, PHP_INI_USER, PHP_INI_STAGE_RUNTIME);
	zend_string_release(name);

	name = zend_string_init("display_errors", sizeof("display_errors") - 1, 0);
	(void)zend_alter_ini_entry_chars(name, "1", 1, PHP_INI_USER, PHP_INI_STAGE_RUNTIME);
	zend_string_release(name);

	name = zend_string_init("display_startup_errors", sizeof("display_startup_errors") - 1, 0);
	(void)zend_alter_ini_entry_chars(name, "1", 1, PHP_INI_USER, PHP_INI_STAGE_RUNTIME);
	zend_string_release(name);

	name = zend_string_init("log_errors", sizeof("log_errors") - 1, 0);
	(void)zend_alter_ini_entry_chars(name, "0", 1, PHP_INI_USER, PHP_INI_STAGE_RUNTIME);
	zend_string_release(name);

	/* Force core globals too: some startup paths format before INI settles. */
	PG(html_errors) = 0;
	PG(display_errors) = PHP_DISPLAY_ERRORS_STDOUT;
	PG(display_startup_errors) = 1;
	PG(log_errors) = 0;
}

static int rp2350_sapi_deactivate(void)
{
	rp2350_platform_flush();
	return SUCCESS;
}

static sapi_module_struct rp2350_sapi_module = {
	"rp2350",
	"RP2350 Embedded SAPI",
	rp2350_sapi_startup,
	php_module_shutdown_wrapper,
	NULL,
	rp2350_sapi_deactivate,
	rp2350_sapi_ub_write,
	rp2350_sapi_flush,
	NULL,
	rp2350_sapi_getenv,
	php_error,
	NULL,
	NULL,
	NULL,
	rp2350_sapi_read_post,
	rp2350_sapi_read_cookies,
	rp2350_sapi_register_variables,
	rp2350_sapi_log_message,
	NULL,
	NULL,
	NULL, /* php_ini_path_override */
	NULL, /* default_post_reader */
	rp2350_sapi_treat_data,
	NULL, /* executable_location */
	0, /* php_ini_ignore */
	0, /* php_ini_ignore_cwd */
	NULL, /* get_fd */
	NULL, /* force_http_10 */
	NULL, /* get_target_uid */
	NULL, /* get_target_gid */
	NULL, /* input_filter */
	rp2350_sapi_ini_defaults, /* ini_defaults */
	1, /* phpinfo_as_text */
	rp2350_ini_entries, /* ini_entries */
	NULL, /* additional_functions */
	NULL, /* input_filter_init */
	NULL  /* pre_request_init */
};

static zend_result rp2350_zend_stream_open(zend_file_handle *handle)
{
	char path[192];
	rp2350_vfs_stream_t *stream;
	const rp2350_vfs_file_t *file;
	char *http_body = NULL;
	size_t http_body_len = 0;
	const char *name = NULL;

	rp2350_stream_open_seen = true;
	if (!handle || !handle->filename) {
		rp2350_stream_open_last_reason = "invalid-handle";
		return FAILURE;
	}
	name = ZSTR_VAL(handle->filename);
	snprintf(rp2350_stream_open_last_in, sizeof(rp2350_stream_open_last_in), "%s", name);

	if (strncmp(name, "http://", 7) == 0) {
		snprintf(rp2350_stream_open_last_path, sizeof(rp2350_stream_open_last_path), "%s", name);
		if (!rp2350_http_get_body(name, 8000, 131072, &http_body, &http_body_len)) {
			rp2350_stream_open_last_reason = "http-fail";
			return FAILURE;
		}
		stream = (rp2350_vfs_stream_t *)malloc(sizeof(*stream));
		if (!stream) {
			free(http_body);
			rp2350_stream_open_last_reason = "malloc-fail";
			return FAILURE;
		}
		stream->src = http_body;
		stream->len = http_body_len;
		stream->pos = 0;
		stream->owned = true;

		rp2350_stream_open_last_reason = "http-hit";
		handle->type = ZEND_HANDLE_STREAM;
		handle->handle.stream.handle = stream;
		handle->handle.stream.isatty = 0;
		handle->handle.stream.reader = rp2350_vfs_reader;
		handle->handle.stream.fsizer = rp2350_vfs_fsizer;
		handle->handle.stream.closer = rp2350_vfs_closer;
		handle->opened_path = zend_string_init(name, strlen(name), 0);
		return SUCCESS;
	}

	if (!rp2350_vfs_resolve_candidate(ZSTR_VAL(handle->filename), path, sizeof(path))) {
		rp2350_stream_open_last_reason = "resolve-fail";
		return FAILURE;
	}
	snprintf(rp2350_stream_open_last_path, sizeof(rp2350_stream_open_last_path), "%s", path);

	file = rp2350_vfs_find(path);
	if (!file) {
		rp2350_stream_open_last_reason = "vfs-miss";
		return FAILURE;
	}
	rp2350_stream_open_last_reason = "vfs-hit";

	stream = (rp2350_vfs_stream_t *)malloc(sizeof(*stream));
	if (!stream) {
		rp2350_stream_open_last_reason = "malloc-fail";
		return FAILURE;
	}
	stream->src = file->source;
	stream->len = file->len;
	stream->pos = 0;
	stream->owned = false;

	handle->type = ZEND_HANDLE_STREAM;
	handle->handle.stream.handle = stream;
	handle->handle.stream.isatty = 0;
	handle->handle.stream.reader = rp2350_vfs_reader;
	handle->handle.stream.fsizer = rp2350_vfs_fsizer;
	handle->handle.stream.closer = rp2350_vfs_closer;
	handle->opened_path = zend_string_init(path, strlen(path), 0);
	return SUCCESS;
}

static void rp2350_log_execute_failure(const char *path)
{
	if (EG(exception)) {
		zend_object *ex = EG(exception);
		zval rv_msg;
		zval rv_file;
		zval rv_line;
		zval *zmsg = zend_read_property_ex(ex->ce, ex, ZSTR_KNOWN(ZEND_STR_MESSAGE), 1, &rv_msg);
		zval *zfile = zend_read_property_ex(ex->ce, ex, ZSTR_KNOWN(ZEND_STR_FILE), 1, &rv_file);
		zval *zline = zend_read_property_ex(ex->ce, ex, ZSTR_KNOWN(ZEND_STR_LINE), 1, &rv_line);
		zend_string *smsg = zmsg ? zval_get_string(zmsg) : NULL;
		zend_string *sfile = zfile ? zval_get_string(zfile) : NULL;
		zend_long lineno = zline ? zval_get_long(zline) : 0;

		snprintf(
			rp2350_eval_error_detail,
			sizeof(rp2350_eval_error_detail),
			"execute exception: %s at %s:%ld",
			smsg ? ZSTR_VAL(smsg) : "<null>",
			sfile ? ZSTR_VAL(sfile) : "<null>",
			(long)lineno
		);
		rp2350_eval_error = rp2350_eval_error_detail;

		if (smsg) {
			zend_string_release(smsg);
		}
		if (sfile) {
			zend_string_release(sfile);
		}
	} else {
		zend_string *exec_file = zend_get_executed_filename_ex();
		snprintf(
			rp2350_eval_error_detail,
			sizeof(rp2350_eval_error_detail),
			"execute failure at %s:%u stream=%d reason=%s in=%s path=%s req=%s zend=%s",
			exec_file ? ZSTR_VAL(exec_file) : "<null>",
			(unsigned)zend_get_executed_lineno(),
			rp2350_stream_open_seen ? 1 : 0,
			rp2350_stream_open_last_reason ? rp2350_stream_open_last_reason : "<null>",
			rp2350_stream_open_last_in[0] ? rp2350_stream_open_last_in : "<none>",
			rp2350_stream_open_last_path[0] ? rp2350_stream_open_last_path : "<none>",
			path ? path : "<null>",
			rp2350_last_zend_error[0] ? rp2350_last_zend_error : "<none>"
		);
		rp2350_eval_error = rp2350_eval_error_detail;
	}
}

static void rp2350_zend_printf_to_smart_string(smart_string *buf, const char *format, va_list ap)
{
	char line[384];
	int n = vsnprintf(line, sizeof(line), format, ap);
	if (n > 0) {
		if ((size_t) n > sizeof(line)) {
			n = (int) sizeof(line);
		}
		smart_string_appendl(buf, line, (size_t) n);
	}
}

static void rp2350_zend_printf_to_smart_str(smart_str *buf, const char *format, va_list ap)
{
	char line[384];
	int n = vsnprintf(line, sizeof(line), format, ap);
	if (n > 0) {
		if ((size_t) n > sizeof(line)) {
			n = (int) sizeof(line);
		}
		smart_str_appendl(buf, line, (size_t) n);
	}
}

static zend_string *rp2350_zend_resolve_path(zend_string *filename)
{
	char path[192];
	const rp2350_vfs_file_t *file;

	if (!filename) {
		return NULL;
	}
	if (strncmp(ZSTR_VAL(filename), "http://", 7) == 0) {
		return zend_string_copy(filename);
	}
	if (!rp2350_vfs_resolve_candidate(ZSTR_VAL(filename), path, sizeof(path))) {
		return NULL;
	}
	file = rp2350_vfs_find(path);
	if (!file) {
		return NULL;
	}
	return zend_string_init(path, strlen(path), 0);
}

static uint32_t rp2350_prng_state = 0x12345678u;

